In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn 
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [3]:
df = pd.read_csv("Titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [7]:
df.drop(["Fare","Pclass","Cabin"], axis = 'columns', inplace = True)

In [8]:
df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,S
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,S

In [10]:
df1=pd.get_dummies(df.Embarked, prefix = "Embarked")
df1.head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [14]:
df.drop(Embarked, axis = 'columns')

NameError: name 'Embarked' is not defined

In [15]:
df.head(2)

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C

In [17]:
df.drop('Embarked',axis='columns',inplace = True)

In [18]:
df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450

In [19]:
df.isnull().sum()

PassengerId      0
Survived         0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
dtype: int64

In [16]:
df1.head(2)

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0

In [20]:
df.shape

(891, 8)

In [23]:
new_df=df.fillna(0)
new_df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450

In [24]:
new_df.isnull().sum()

PassengerId    0
Survived       0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
dtype: int64

In [26]:
df3 = pd.concat([new_df,df1], axis = 'columns')
df3.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Embarked_C,Embarked_Q,Embarked_S
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,0,0,1
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,0,0,1

In [28]:
df3.drop("Embarked_C", axis = 'columns',inplace = True)

KeyError: "['Embarked_C'] not found in axis"

In [29]:
df3.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Embarked_Q,Embarked_S
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,0,1
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,0,1

In [30]:
y = df3.Survived
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [32]:
X = df3
X.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Embarked_Q,Embarked_S
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,0,1
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,0,1

In [35]:
subdf = df3[['PassengerId','Age','Parch','Embarked_Q','Embarked_S']]
subdf.head()

   PassengerId   Age  Parch  Embarked_Q  Embarked_S
0            1  22.0      0           0           1
1            2  38.0      0           0           0
2            3  26.0      0           0           1
3            4  35.0      0           0           1
4            5  35.0      0           0           1

In [37]:
X=subdf
X.head()

   PassengerId   Age  Parch  Embarked_Q  Embarked_S
0            1  22.0      0           0           1
1            2  38.0      0           0           0
2            3  26.0      0           0           1
3            4  35.0      0           0           1
4            5  35.0      0           0           1

In [38]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [47]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2)

In [48]:
len(X_train)

712

In [49]:
len(X_test)

179

In [50]:
model = LogisticRegression()

In [51]:
model.fit(X_train, y_train)

LogisticRegression()

In [52]:
model.predict(X_test)

array([1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1], dtype=int64)

In [54]:
model.score(X_test, y_test)

0.6368715083798883